delements = [
    "H - Водороду принадлежит звание самого горячего элемента. В звёздах, включая Солнце, происходят реакции синтеза водорода, выделяющие огромное количество энергии в форме света и тепла.",
    "He - Гелий — один из первых химических элементов, возникших после Большого Взрыва. Наша Вселенная практически на треть состоит из гелия."
    "Li - Литий используется в медицине для лечения ипохондрии, депрессивных состояний и ряда других психических заболеваний за счёт психотропных свойств этого элемента."
    "Be - Бериллий слабо поглощает рентгеновское излучение, поэтому из него изготавливают окошки рентгеновских трубок и окошки рентгеновских и широкодиапазонных гамма-детекторов."
    "B - Бор является важным микроэлементом для растений. Он помогает регулировать рост и развитие растений, а также улучшает их способность переносить стресс и болезни"
    "C - Животные и растения примерно на 17% состоят из углерода, в организм человека этот элемент в объёме около 300 г в сутки поступает с пищей."
    "N - Теплоёмкость азота довольно низка, поэтому невозможно моментально заморозить предмет, погрузив его в этот сжижённый газ. Любой предмет должен пробыть в ёмкости с жидким азотом какое-то время, чтобы достаточно сильно замёрзнуть."
    "O - Кислород может быть не только газообразным, но и жидким, и даже твёрдым. Жидкий кислород — подвижная, слегка голубоватая жидкость, а твёрдый — кристаллы синего цвета."
    "F - Около 25% лекарств и медикаментов, в том числе для рака, центральной нервной системы и сердечно-сосудистой системы, содержат некую форму фтора."
    "Ne - Свет, излучаемый ионизированным неоном, может проходить сквозь водяной туман. Вот почему неоновое освещение используется в холодных регионах, а также для самолётов и аэропортов."
    "Na - Натрий играет большую роль в жизни живых организмов. Он необходим для нормального обмена веществ, работы нервной и сердечно-сосудистой систем."
    "Mg - Магний — восьмой наиболее распространённый элемент в земной коре. Это четвёртый наиболее распространённый элемент на Земле в целом, он составляет 13% массы планеты."
    "Al - Алюминий обнаружили даже на Луне и на Марсе."
    "Si - Кремний — основной элемент во всех горных породах, за исключением одной разновидности — карбонатов. Глина, например, содержит в среднем 50% кремния."
    "P - Фосфор является важнейшим биогенным элементом. Он участвует в синтезе универсального источника энергии для всех биохимических процессов — АТФ."
    "S - Сера в чистом виде не ядовита, а вот её соединения (сернистый газ, сероводород и др.) опасны для жизни."
    "Cl - Хлор — третий по распространённости элемент в океане (около 1,9% по массе) и 21-й по распространённости элемент в земной коре."
    "Ar - Аргон благоприятствует росту растений. Даже в атмосфере чистого аргона семена риса, кукурузы, огурцов и ржи выкидывают ростки. Лук, морковь и салат хорошо прорастают в атмосфере, состоящей из 98% аргона и только 2% кислорода."
    "K - Металлический калий может вызвать очень сильные ожоги кожи, при попадании мельчайших частичек калия в глаза возникают тяжёлые поражения с потерей зрения, поэтому работать с металлическим калием можно только в защитных перчатках и очках."
    "Ca - Главное применение металлического кальция — это использование его как восстановителя при получении металлов, особенно никеля, меди и нержавеющей стали."
    "Sc - В природе он встречается в рассеянном состоянии и входит в состав около 100 минералов."
    "Ti - Титан присутствует в метеоритах, Солнце и других звёздах."
    "V - Название элемента произошло от имени древнескандинавской богини красоты — Ванадис. Это произошло из-за того, что на воздухе на поверхности металла образуется красивая плёнка из разноцветных оксидов."
    "Cr - Хром уменьшает интенсивность синтеза жиров в теле человека, снижает аппетит, тем самым способствуя естественному снижению веса."
    "Mn - Избыток марганца в организме сказывается на функционировании центральной нервной системы"
    "Fe - Когда люди только научились добывать железо и обрабатывать его, оно стоило дороже золота."
    "Co - Первооткрывателем кобальта является шведский минералог Георг Брандт. Он также выяснил, что соединения кобальта окрашивают стекло в синий цвет."
    "Ni - По гипотезе учёных, ядро Земли на 3% состоит из никеля. При этом на поверхности планеты этот элемент довольно редкий, а в ядре его в 100 раз больше, чем в земной коре."
    "Cu - Медь препятствует распространению бактерий по своей поверхности.",
    "Zn - Сплав цинка с медью — это латунь. Он был известен ещё в древние времена, им пользовались и греки, и египтяне."
    "Ga - Существование галлия было предсказано Д. И. Менделеевым. При создании периодической системы химических элементов в 1869 году он оставил вакантные места в третьей группе для неизвестных элементов — аналогов алюминия и кремния."
    "Ge - Существование германия предсказал в начале 1870-х годов Д. И. Менделеев"
    "As - В западных странах мышьяк был известен преимущественно как сильный яд, в то же время в традиционной китайской медицине он почти на протяжении двух тысяч лет использовался для лечения сифилиса и псориаза."
    "Se - Селен получил своё название от греческого слова «селена», что означает «луна»."
    "Br - Это единственный неметалл в периодической таблице, который является жидким при обычных условиях."
    "Kr - Криптон-85 используется для исследования потока крови в организме человека: когда этот газ вдыхают, он абсорбируется кровью и путешествует по кровеносной системе вместе с кровью."
    "Rb - Рубидий способен вырабатывать электрический ток под воздействием солнечного излучения."
    "Sr - В свободном виде стронций не встречается из-за своей высокой химической активности. Он входит в состав около 40 минералов."
    "Y - Радиоактивный изотоп иттрия-90 использовался в медицинских целях для лечения разных видов рака, включая лимфому, лейкоз, рак печени, толстой кишки, яичников и многих других."
    "Zr - Минерал циркон, из которого выделяется цирконий, довольно широко распространён на поверхности Земли: он часто встречается в песках прибрежных вод."
    "Nb - Высокая коррозионная стойкость ниобия позволила использовать его в медицине. Ниобиевые нити не вызывают раздражения живой ткани и хорошо сращиваются с ней. Восстановительная хирургия успешно использует такие нити для сшивания порванных сухожилий, кровеносных сосудов и даже нервов."
    "Mo - Это микроэлемент участвует в метаболизме растений и животных и содержится в бобовых, зерновых продуктах и орехах."
    "Tc - Технеций был первым элементом, полученным искусственным путём."
    "Ru - Рутений — единственный из открытых в России химических элементов, который получен естественным путём, то есть извлечён из минерального сырья."
    "Rh - Из родия делают зеркала для лазерных установок: он отлично отражает свет и очень плохо плавится."
    "Pd - Палладий способен усиливать антикоррозионные свойства."
    "Ag - В Швейцарии при помощи серебра лечили зубную боль. Для этого пациенту давали монету, он прикладывал её к больному зубу, и через некоторое время боль стихала."
    "Cd - Если кадмиевую палочку изгибать, то можно услышать слабый треск — это трутся друг о друга микрокристаллы металла."
    "In - На воздухе на поверхности металлического индия образуется оксидная плёнка, предохраняющая металл от дальнейшего окисления."
    "Sn - Когда брусок олова сгибают, кристаллы разрушаются, издавая характерный «оловянный крик»."
    "Sb - Алхимики Средневековья считали сурьму важным элементом в поисках философского камня и эликсира бессмертия."
    "Te - Распространённость теллура в земной коре значительно меньше, чем распространённость во Вселенной. Учёные считают, что так произошло из-за того, что летучие соединения теллура «ушли» в космос сразу же после формирования Земли."
    "I - Йод был открыт случайно в 1811 году французским химиком Бернаром Куртуа при получении селитры из морских водорослей."
    "Xe - Ксенон является одним из самых редких газов в атмосфере Земли, что делает его добычу и использование экономически затратным."
]

ptable = {
    1: {"symbol": "H", "name": "Водород", "mass": 1.008, "properties": "Газ, бесцветный, не имеет запаха.", "fact": "Самый распространённый элемент во Вселенной."},
    2: {"symbol": "He", "name": "Гелий", "mass": 4.0026, "properties": "Газ, инертный, бесцветный.", "fact": "Используется в воздушных шарах."},
    3: {"symbol": "Li", "name": "Литий", "mass": 6.941, "properties": "Метал, серебристо-белый, щелочный", "fact": "Литий используется в медицине для лечения ипохондрии, депрессивных состояний и ряда других психических заболеваний за счёт психотропных свойств этого элемента."},
    4: {"symbol": "Be", "name": "Бериллий", "mass": 9.0122, "properties": "Метал, серебристо-серый с масляным блеском, очень легкий и прочный.", "fact": "Бериллий слабо поглощает рентгеновское излучение, поэтому из него изготавливают окошки рентгеновских трубок и окошки рентгеновских и широкодиапазонных гамма-детекторов."},
    5: {"symbol": "B", "name": "Бор", "mass": 10.811, "properties": "Вещество, бесцветный, инертный", "fact": "Бор является важным микроэлементом для растений. Он помогает регулировать рост и развитие растений, а также улучшает их способность переносить стресс и болезни"},
    6: {"symbol": "C", "name": "Углерод", "mass": 12.011, "properties": "Твердая структура, без запаха, бесцветный.", "fact": "Животные и растения примерно на 17% состоят из углерода, в организм человека этот элемент в объёме около 300 г в сутки поступает с пищей."},
    7: {"symbol": "N", "name": "Азот", "mass": 14.007, "properties": "Газ, бесцветный, не имеет запаха.", "fact": "Теплоёмкость азота довольно низка, поэтому невозможно моментально заморозить предмет, погрузив его в этот сжижённый газ. Любой предмет должен пробыть в ёмкости с жидким азотом какое-то время, чтобы достаточно сильно замёрзнуть."},
    8: {"symbol": "O", "name": "Кислород", "mass": 15.999, "properties": "Газ, без запаха, бесцветный.", "fact": "Кислород может быть не только газообразным, но и жидким, и даже твёрдым. Жидкий кислород — подвижная, слегка голубоватая жидкость, а твёрдый — кристаллы синего цвета."},
    9: {"symbol": "F", "name": "Фтор", "mass": 18.998, "properties": "Газ, бледно-желтый, с резким запахом", "fact": "Около 25% лекарств и медикаментов, в том числе для рака, центральной нервной системы и сердечно-сосудистой системы, содержат некую форму фтора."},
    10: {"symbol": "Ne", "name": "Неон", "mass": 20.179, "properties": "Газ, без запаха, бесцветный.", "fact": "Свет, излучаемый ионизированным неоном, может проходить сквозь водяной туман. Вот почему неоновое освещение используется в холодных регионах, а также для самолётов и аэропортов."},
    11: {"symbol": "Na", "name": "Натрий", "mass": 22.99, "properties": "Серебристо-белый металл, пластичен, высокое показатели электропроводности", "fact": "Натрий играет большую роль в жизни живых организмов. Он необходим для нормального обмена веществ, работы нервной и сердечно-сосудистой систем."},
    12: {"symbol": "Mg", "name": "Магний", "mass": 24.305, "properties": "Лёгкий металл серебристо-белого цвета с гексагональной решёткой, обладает металлическим блеском. ", "fact": "Магний — восьмой наиболее распространённый элемент в земной коре. Это четвёртый наиболее распространённый элемент на Земле в целом, он составляет 13% массы планеты."},
    13: {"symbol": "Al", "name": "Алюминий", "mass": 26.9815, "properties": "Серебристо-белый металл, легкий, пластичный", "fact": "Алюминий обнаружили даже на Луне и на Марсе."},
    14: {"symbol": "Si", "name": "Кремний", "mass": 28.086, "properties": "Тёмно-серый, с металлическим блеском. Хрупкий, при нагревании свыше 800 °C пластичный.", "fact": "Кремний — основной элемент во всех горных породах, за исключением одной разновидности — карбонатов. Глина, например, содержит в среднем 50% кремния."},
    15: {"symbol": "P", "name": "Фосфор", "mass": 30.974, "properties": "Обладает 4 модификациями - Белый, Красный, Черный, Металлический", "fact": "Фосфор является важнейшим биогенным элементом. Он участвует в синтезе универсального источника энергии для всех биохимических процессов — АТФ."},
    16: {"symbol": "S", "name": "Сера", "mass": 32.066, "properties": "Твёрдое кристаллическое вещество жёлтого цвета, без запаха. В воде сера нерастворима, но хорошо растворяется в органических растворителях, например, в сероуглероде, скипидаре.", "fact": "Сера в чистом виде не ядовита, а вот её соединения (сернистый газ, сероводород и др.) опасны для жизни."},
    17: {"symbol": "Cl", "name": "Хлор", "mass": 35.453, "properties": "Жёлто-зелёный. Тяжелее воздуха. Резкий сладковатый запах.", "fact": "Хлор — третий по распространённости элемент в океане (около 1,9% по массе) и 21-й по распространённости элемент в земной коре."},
    18: {"symbol": "Ar", "name": "Аргон", "mass": 39.948, "properties": "Тяжелее воздуха в 1,38 раза. Адсорбируется на поверхностях твёрдых тел. Растворяется в воде и органических жидкостях.", "fact": "Аргон благоприятствует росту растений. Даже в атмосфере чистого аргона семена риса, кукурузы, огурцов и ржи выкидывают ростки. Лук, морковь и салат хорошо прорастают в атмосфере, состоящей из 98% аргона и только 2% кислорода."},
    19: {"symbol": "K", "name": "Калий", "mass": 39.098, "properties": "Серебристо-белый металл с характерным блеском на свежеобразованной поверхности. Металлический калий легко режется ножом. ", "fact": "Металлический калий может вызвать очень сильные ожоги кожи, при попадании мельчайших частичек калия в глаза возникают тяжёлые поражения с потерей зрения, поэтому работать с металлическим калием можно только в защитных перчатках и очках."},
    20: {"symbol": "Ca", "name": "Кальций", "mass": 40.08, "properties": "Серебристо-белый мягкий металл. Пластичный металл, хорошо прессуется, прокатывается и подвергается обработке резанием.", "fact": "Главное применение металлического кальция — это использование его как восстановителя при получении металлов, особенно никеля, меди и нержавеющей стали."},
    21: {"symbol": "Sc", "name": "Скандий", "mass": 44.956, "properties": "Лёгкий металл серебристого цвета с характерным жёлтым отливом. Мягкий металл, с чистотой 99,5% и выше (в отсутствие O2) легко поддаётся механической обработке. ", "fact": "В природе он встречается в рассеянном состоянии и входит в состав около 100 минералов."},
    22: {"symbol": "Ti", "name": "Титан", "mass": 47.90, "properties": "Метал, серебристо-белый, очень прочный и вязкий", "fact": "Титан присутствует в метеоритах, Солнце и других звёздах."},
    23: {"symbol": "V", "name": "Ванадий", "mass": 50.941, "properties": "Пластичный металл серебристо-серого цвета, по внешнему виду похож на сталь. ", "fact": "Название элемента произошло от имени древнескандинавской богини красоты — Ванадис. Это произошло из-за того, что на воздухе на поверхности металла образуется красивая плёнка из разноцветных оксидов."},
    24: {"symbol": "Cr", "name": "Хром", "mass": 51.996, "properties": "Голубовато-белый с металлическим блеском. Один из самых твёрдых металлов.", "fact": "Хром уменьшает интенсивность синтеза жиров в теле человека, снижает аппетит, тем самым способствуя естественному снижению веса."},
    25: {"symbol": "Mn", "name": "Марганец", "mass": 54.938, "properties": "Серебристо-белый металл. Твёрдая и хрупкий.", "fact": "Избыток марганца в организме сказывается на функционировании центральной нервной системы"},
    26: {"symbol": "Fe", "name": "Железо", "mass": 55.847, "properties": "Серебристо-серый с металлическим блеском. На воздухе покрывается оксидной плёнкой. Пластичный, ковкий.", "fact": "Когда люди только научились добывать железо и обрабатывать его, оно стоило дороже золота."},
    27: {"symbol": "Co", "name": "Кобальт", "mass": 58.933, "properties": "Твердый, тягучий, блестящий металл.", "fact": "Первооткрывателем кобальта является шведский минералог Георг Брандт. Он также выяснил, что соединения кобальта окрашивают стекло в синий цвет."},
    28: {"symbol": "Ni", "name": "Никель", "mass": 58.70, "properties": "Серебристо-белый метал, пластичен", "fact": "По гипотезе учёных, ядро Земли на 3% состоит из никеля. При этом на поверхности планеты этот элемент довольно редкий, а в ядре его в 100 раз больше, чем в земной коре."},
    29: {"symbol": "Cu", "name": "Медь", "mass": 63.546, "properties": "Металл, жёлто-красный, красноватый, в зависимости от вида руды.", "fact": "Медь препятствует распространению бактерий по своей поверхности."},
    30: {"symbol": "Zn", "name": "Цинк", "mass": 65.39, "properties": "Голубовато-белый, с металлическим блеском. При нормальных условиях хрупкий, особенно при наличии примесей, при нагревании до 150 °С пластичный и ковкий, при температуре выше 200 °С снова хрупкий, растирается в порошок.", "fact": "Сплав цинка с медью — это латунь. Он был известен ещё в древние времена, им пользовались и греки, и египтяне."},
    31: {"symbol": "Ga", "name": "Галий", "mass": 69.72, "properties": "Метал, твёрдое", "fact": "Существование галлия было предсказано Д. И. Менделеевым. При создании периодической системы химических элементов в 1869 году он оставил вакантные места в третьей группе для неизвестных элементов — аналогов алюминия и кремния."},
    32: {"symbol": "Ge", "name": "Германий", "mass": 72.59, "properties": "Светло-серое вещество с металлическим блеском, хрупкое и твёрдое.", "fact": "Существование германия предсказал в начале 1870-х годов Д. И. Менделеев"},
    33: {"symbol": "As", "name": "Мышьяк", "mass": 74.992, "properties": "Серебристо-серое или оловянно-белое вещество", "fact": "В западных странах мышьяк был известен преимущественно как сильный яд, в то же время в традиционной китайской медицине он почти на протяжении двух тысяч лет использовался для лечения сифилиса и псориаза."},
    34: {"symbol": "Se", "name": "Селен", "mass": 78.96, "properties": "Это хрупкий, блестящий на изломе неметалл серого цвета.", "fact": "Селен получил своё название от греческого слова «селена», что означает «луна»."},
    35: {"symbol": "Br", "name": "Бром", "mass": 79.904, "properties": "Красно-бурая жидкость.", "fact": "Это единственный неметалл в периодической таблице, который является жидким при обычных условиях."},
    36: {"symbol": "Kr", "name": "Криптон", "mass": 83.80, "properties": "Бесцветный газ.", "fact": "Криптон-85 используется для исследования потока крови в организме человека: когда этот газ вдыхают, он абсорбируется кровью и путешествует по кровеносной системе вместе с кровью."},
    37: {"symbol": "Rb", "name": "Рубидий", "mass": 85.468, "properties": "Мягкий, легкоплавкий серебристо-белый металл.", "fact": "Рубидий способен вырабатывать электрический ток под воздействием солнечного излучения."},
    38: {"symbol": "Sr", "name": "Стронций", "mass": 87.62, "properties": "Серебристо-белый металл.", "fact": "В свободном виде стронций не встречается из-за своей высокой химической активности. Он входит в состав около 40 минералов."},
    39: {"symbol": "Y", "name": "Иттрий", "mass": 88.906, "properties": "Светло-серебристый металл, пластичен, высокое показатели электропроводности", "fact": "Радиоактивный изотоп иттрия-90 использовался в медицинских целях для лечения разных видов рака, включая лимфому, лейкоз, рак печени, толстой кишки, яичников и многих других."},
    40: {"symbol": "Zr", "name": "Цирконий", "mass": 91.22, "properties": "Серебристо-серый (в порошкообразном виде тёмно-серый) блестящий металл.", "fact": "Минерал циркон, из которого выделяется цирконий, довольно широко распространён на поверхности Земли: он часто встречается в песках прибрежных вод."},
    41: {"symbol": "Nb", "name": "Ниобий", "mass": 92.906, "properties": "Блестящий серебристо-серый металл. При длительном воздействии воздуха комнатной температуры металл приобретает голубоватый оттенок.", "fact": "Высокая коррозионная стойкость ниобия позволила использовать его в медицине. Ниобиевые нити не вызывают раздражения живой ткани и хорошо сращиваются с ней. Восстановительная хирургия успешно использует такие нити для сшивания порванных сухожилий, кровеносных сосудов и даже нервов."},
    42: {"symbol": "Mo", "name": "Молибден", "mass": 95.94, "properties": "Металл серо-стального цвета", "fact": "Это микроэлемент участвует в метаболизме растений и животных и содержится в бобовых, зерновых продуктах и орехах."},
    43: {"symbol": "Tc", "name": "Технеций", "mass": 97.91, "properties": "Серебристо-серый металл.", "fact": "Технеций был первым элементом, полученным искусственным путём."},
    44: {"symbol": "Ru", "name": "Рутений", "mass": 101.07, "properties": "Серебристо-белый, иногда немного матовый. Металл", "fact": "Рутений — единственный из открытых в России химических элементов, который получен естественным путём, то есть извлечён из минерального сырья."},
    45: {"symbol": "Rh", "name": "Родий", "mass": 102.906, "properties": "Серебристо-серый металл с высоким отражением света.", "fact": "Из родия делают зеркала для лазерных установок: он отлично отражает свет и очень плохо плавится."},
    46: {"symbol": "Pd", "name": "Палладий", "mass": 106.4, "properties": "Серебристо-белый металл.", "fact": "Палладий способен усиливать антикоррозионные свойства."},
    47: {"symbol": "Ag", "name": "Серебро", "mass": 107.868, "properties": "Белый блестящий мягкий пластичный металл", "fact": "В Швейцарии при помощи серебра лечили зубную боль. Для этого пациенту давали монету, он прикладывал её к больному зубу, и через некоторое время боль стихала."},
    48: {"symbol": "Cd", "name": "Кадмий", "mass": 112.41, "properties": "Серебристо-белый мягкий, ковкий, тягучий металл.", "fact": "Если кадмиевую палочку изгибать, то можно услышать слабый треск — это трутся друг о друга микрокристаллы металла."},
    49: {"symbol": "In", "name": "Индий", "mass": 114.82, "properties": "Серебристо-белый металл с сильным блеском.", "fact": "На воздухе на поверхности металлического индия образуется оксидная плёнка, предохраняющая металл от дальнейшего окисления."},
    50: {"symbol": "Sn", "name": "Олово", "mass": 118.71, "properties": "Серебристо-белый цвет с блестящей поверхностью.", "fact": "Когда брусок олова сгибают, кристаллы разрушаются, издавая характерный «оловянный крик».х."},
    51: {"symbol": "Sb", "name": "Сурьма", "mass": 121.75, "properties": "Полуметалл серебристо-белого цвета с синеватым оттенком.", "fact": "Алхимики Средневековья считали сурьму важным элементом в поисках философского камня и эликсира бессмертия."},
    52: {"symbol": "Te", "name": "Теллур", "mass": 127.60, "properties": "Серебристо-серое вещество с металлическим блеском, в тонких слоях красно-коричневый, в парах — золотисто-жёлтый.", "fact": "Распространённость теллура в земной коре значительно меньше, чем распространённость во Вселенной. Учёные считают, что так произошло из-за того, что летучие соединения теллура «ушли» в космос сразу же после формирования Земли."},
    53: {"symbol": "I", "name": "Иод", "mass": 126.9045, "properties": "Твёрдое вещество, чёрно-серые или тёмно-фиолетовые кристаллы", "fact": "Йод был открыт случайно в 1811 году французским химиком Бернаром Куртуа при получении селитры из морских водорослей."},
    54: {"symbol": "Xe", "name": "Ксенон", "mass": 131.29, "properties": "Бесцветный газ.", "fact": "Ксенон является одним из самых редких газов в атмосфере Земли, что делает его добычу и использование экономически затратным."},
}

command = ("/start - Запусти или перезапусти бота\n"
            "/commands - Помощь по командам\n"
            "/bot - Запусти режим нейросети\n"
            "/table - Интерактивная таблица Менделеева\n"
            "/daily - Запуск ежедневных интересных фактов про эл-ты химии\n"
            "/formula - Популярные формулы в химии")

simpleformula = ("CaO + H2O = Ca(OH)2 — негашёная известь соединяется с водой, и образуется новое сложное вещество — гашёная известь. 3\n" 
                 "2СО + О2 = 2СО2↑ — оксид углерода (ІІ) + кислород = оксид углерода (IV).\n"
                 "Fe + S = FeS↓ — феррум + сера = сульфид железа (ІІ).\n" 
                 "2Fe + 3Cl2 = 2FeCl3 — феррум + хлор = хлорид железа (ІІІ).\n"  
                 "S + O2 = SO2↑ — сера + кислород = диоксид серы.\n" 
                 "2SO2 + O2 = 2SO3↑ — диоксид серы + кислород = триоксид серы.\n"  
                 "H2 + S = H2S — водород + сера = сероводород.\n"  
                 "SO3 + H2O = H2SO4 — триоксид серы + вода = серная кислота.\n"  
                 "КOH + H2SO4 = KHSO4 — гидроксид калия + серная кислота = гидросульфат калия.\n"  
                 "CaCO3 = CaO + CO2↑ — если нагреть известняк, получаются негашёная известь и углекислый газ.\n"
                 "2Ba + O2 = 2BaO — барий и кислород взаимодействуют с образованием оксида бария.\n"  
                 "Na2O + H2O = 2NaOH — взаимодействие оксида натрия с водой с образованием гидроксида натрия.\n"  
                 "2AgNO3 = 2Ag + 2NO2↑ + O2↑ — разложение нитрата серебра на серебро, оксид азота (IV) и кислород.\n"  
                 "Zn + 2HCl = ZnCl2 + H2↑ — замещение атомов водорода в молекуле соляной кислоты на атомы цинка.\n"  
                 "CaCl2 + Na2CO3 = CaCO3↓ + 2NaCl — при сливании растворов CaCl2 и Na2CO3 выпадает осадок.\n"  
                 "Cu(OH)2 = tCuO + H2O — разложение гидроксида меди на оксид и воду происходит при нагревании.\n"  
                 "H2(г) + Cl2(г) = 2HCl — взаимодействие двух газообразных веществ — водорода и хлора.\n"  
                 "2Na(тв) + 2H2O(ж) = 2NaOH + H2 — реакция между веществами, которые находятся в разных агрегатных состояниях.\n" 
                 "2Ag2O = 4Ag + O2 — разложение оксида серебра на серебро и кислород.\n"  
                 "2Fe(OH)3 = Fe2O3 + 3H2O — разложение гидроксида железа на оксид железа (III) и воду.\n")