delements = [
    "H - Водороду принадлежит звание самого горячего элемента. В звёздах, включая Солнце, происходят реакции синтеза водорода, выделяющие огромное количество энергии в форме света и тепла.",
    "He - Гелий — один из первых химических элементов, возникших после Большого Взрыва. Наша Вселенная практически на треть состоит из гелия."
]
ptable = {
    1: {"symbol": "H", "name": "Водород", "mass": 1.008, "properties": "Газ, бесцветный, не имеет запаха.", "fact": "Самый распространённый элемент во Вселенной."},
    2: {"symbol": "He", "name": "Гелий", "mass": 4.0026, "properties": "Газ, инертный, бесцветный.", "fact": "Используется в воздушных шарах."},
}
command = ("/start - Запусти или перезапусти бота\n"
            "/commands - Помощь по командам\n"
            "/bot - Запусти режим нейросети\n"
            "/table - Интерактивная таблица менделеева\n"
            "/daily - Запуск ежедневных интересных фактов про эл-ты химии")